In [1]:
import pandas as pd

In [9]:
e=pd.DataFrame({'Month':['January','January','January','January','February','February','February','February',
                        'March', 'March', 'March', 'March'],
               'Category':['Transportation','Grocery','Household','Entertainment',
                          'Transportation','Grocery','Household','Entertainment',
                           'Transportation','Grocery','Household','Entertainment'],
                'Amount':[74,235,175,100,115,240,225,125,90,260,200,120]})

In [10]:
e

       Month        Category  Amount
0    January  Transportation      74
1    January         Grocery     235
2    January       Household     175
3    January   Entertainment     100
4   February  Transportation     115
5   February         Grocery     240
6   February       Household     225
7   February   Entertainment     125
8      March  Transportation      90
9      March         Grocery     260
10     March       Household     200
11     March   Entertainment     120

# 下面说一说pivot   （其实就是对表格进行重塑）

# pivot里面有三个参数，index columns，还有value

# index是新表格的索引，columns是新表格的列名

# value是新表格的值

In [11]:
e

       Month        Category  Amount
0    January  Transportation      74
1    January         Grocery     235
2    January       Household     175
3    January   Entertainment     100
4   February  Transportation     115
5   February         Grocery     240
6   February       Household     225
7   February   Entertainment     125
8      March  Transportation      90
9      March         Grocery     260
10     March       Household     200
11     March   Entertainment     120

In [15]:
f=e.pivot(index='Category',columns='Month',values='Amount')
f

Month           February  January  March
Category
Entertainment        125      100    120
Grocery              240      235    260
Household            225      175    200
Transportation       115       74     90

# 在上面的基础上可以进一步统计

In [17]:
f.sum(axis=0)

Month
February    705
January     584
March       670
dtype: int64

In [18]:
f.sum(axis=1)

Category
Entertainment     345
Grocery           735
Household         600
Transportation    279
dtype: int64

# ----------------------------------------------------------------------------------

In [19]:
df=pd.read_csv('./data/train.csv')

In [20]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
df.pivot_table(index='Sex',columns='Pclass',values='Fare')

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

# df.pivot_table(index='Sex',columns='Pclass',values='Fare')

# 统计的是平均值

In [24]:
df.pivot_table(index='Sex',columns='Pclass',values='Fare',aggfunc='max')

Pclass         1     2      3
Sex
female  512.3292  65.0  69.55
male    512.3292  73.5  69.55

# df.pivot_table(index='Sex',columns='Pclass',values='Fare',aggfunc='max')

# 求最大

# df.pivot_table(index='Sex',columns='Pclass',values='Fare',aggfunc='count')
# 计数操作   ：   aggfunc='count'

In [25]:
df.pivot_table(index='Sex',columns='Pclass',values='Fare',aggfunc='count')

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

# 进行计数操作的论另外一钟方法：

In [30]:
pd.crosstab(index=df['Sex'],columns=df['Pclass'])

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

# 上面的格式要记住

# ------------------------------------------------------------------------------

In [32]:
df.pivot_table(index='Pclass',columns='Sex',values='Survived',aggfunc='mean')

Sex       female      male
Pclass
1       0.968085  0.368852
2       0.921053  0.157407
3       0.500000  0.135447